Repository: vanzaam/OmniBLE
Catalog: OmniBLE/Localizable.xcstrings
Source language: en
Languages: cs, da, de, es, fr, it, ja, nb, nb_no, nl, pl, ro, ru, sk, sv, tr, uk, vi

source: %1$@ has been unable to communicate with the pod on your body since %2$@. Do not Discard the Pod without scrolling to read this entire screen. Communication was interrupted at a critical time. Information about active insulin / pod temp basal rate is uncertain. You can toggle phone Bluetooth off and on or quit and restart the app. (Wait up to 30 seconds for recovery.) If you decide to give up because communication cannot be restored, tap the Discard Pod button, follow the steps and start a new pod. Monitor your glucose closely for the next 6 hours, as there may or may not be insulin actively working in your body that %3$@ cannot display.
fr: %1$@ n'a pas pu communiquer avec le pod sur votre corps depuis %2$@. Ne jetez pas le pod sans avoir fait défiler l'écran pour lire l'intégralité de cet écran. La communication a été interrompue à un moment critique. Les informations sur l'insuline active / le débit basal temporaire du pod sont incertaines. Vous pouvez activer et désactiver le Bluetooth du téléphone ou quitter et redémarrer l'application. (Attendez jusqu'à 30 secondes pour la récupération.) Si vous décidez d'abandonner parce que la communication ne peut pas être rétablie, appuyez sur le bouton Jeter le pod, suivez les étapes et démarrez un nouveau pod. Surveillez attentivement votre glycémie pendant les 6 prochaines heures, car il peut y avoir ou non de l'insuline active dans votre corps que %3$@ ne peut pas afficher.
it: %1$@ non è riuscito a comunicare con il Pod sul tuo corpo da %2$@. Non scartare il Pod senza aver letto completamente questa schermata. La comunicazione è stata interrotta in un momento critico. Le informazioni sull'insulina attiva/velocità basale temporanea del Pod sono incerte. Puoi disattivare e riattivare il Bluetooth del telefono o uscire e riavviare l'app. (Attendi fino a 30 secondi per il ripristino.) Se decidi di rinunciare perché la comunicazione non può essere ripristinata, tocca il pulsante "Scarta Pod", segui i passaggi e avvia un nuovo Pod. Monitora attentamente la glicemia per le prossime 6 ore, poiché potrebbe esserci o meno insulina attiva nel tuo corpo che %3$@ non può visualizzare.
nb: %1$@ har ikke vært i stand til å kommunisere med pod på kroppen din siden %2$@. Ikke kast pod uten å bla for å lese hele beskjeden. Kommunikasjonen ble avbrutt på et kritisk tidspunkt. Informasjon om aktivt insulin / podens midlertidige basalhastighet er usikker. Du kan slå telefonens Bluetooth av og på, eller avslutte og starte appen på nytt. (Vent i opptil 30 sekunder på gjenoppretting.) Hvis du bestemmer deg for å gi opp fordi kommunikasjonen ikke kan gjenopprettes, trykk på Kast pod-knappen, følg trinnene og start en ny pod. Overvåk blodsukkeret dit nøye de neste 6 timene, da det kan være insulin som aktivt virker i kroppen din som %3$@ ikke kan vise.
nb_no: %1$@ har ikke vært i stand til å kommunisere med pod på kroppen din siden %2$@. Ikke kast pod uten å bla for å lese hele beskjeden. Kommunikasjonen ble avbrutt på et kritisk tidspunkt. Informasjon om aktivt insulin / podens midlertidige basalhastighet er usikker. Du kan slå telefonens Bluetooth av og på, eller avslutte og starte appen på nytt. (Vent i opptil 30 sekunder på gjenoppretting.) Hvis du bestemmer deg for å gi opp fordi kommunikasjonen ikke kan gjenopprettes, trykk på Kast pod-knappen, følg trinnene og start en ny pod. Overvåk blodsukkeret dit nøye de neste 6 timene, da det kan være insulin som aktivt virker i kroppen din som %3$@ ikke kan vise.
nl: %1$@ is sinds %2$@niet in staat om te communiceren met de pod op je lichaam. Verwijder de Pod niet zonder te scrollen om dit hele scherm te lezen. Communicatie werd op een kritiek moment onderbroken Informatie over de actieve insuline / pod tijdelijke basaalstand is onduidelijk. Je kunt RileyLink-verbinding (hieronder) aan-/uitzetten. Schakel Bluetooth van je telefoon uit en aan; zet het RileyLink-apparaat uit en aan; of probeer een andere RileyLink uit. Wacht tot 30 seconden op herstel. Als je besluit om op te geven omdat de communicatie niet kan worden hersteld. tik op de knop Verwijderen van Pod, volg de stappen en start een nieuwe pod. Volg jouw glucose goed voor de komende 6 uur. Als er al dan niet insuline actief werkt in je lichaam dat %3$@ niet kan tonen.
ro: %1$@ nu a putut comunica cu pompa de pe corpul dumneavoastră din %2$@. Nu înlăturați pompal fără a derula pentru a citi întregul ecran. Comunicarea a fost întreruptă într-un moment critic. Informațiile despre insulina activă / rata bazală temporară ale pompei sunt incerte. Puteți dezactiva și activa Bluetooth-ul telefonului sau puteți închide și reporni aplicația. (Așteptați până la 30 de secunde pentru recuperare.) Dacă decideți să renunțați deoarece comunicarea nu poate fi restabilită, atingeți butonul Înlăturați pompa, urmați pașii și porniți o pompă nouă. Monitorizați-vă cu atenție glicemia pentru următoarele 6 ore, deoarece este posibil să existe sau nu insulină care acționează activ în corpul dumneavoastră și pe care %3$@ nu o poate afișa.
sk: %1$@ sa nedokázal spojiť s podom na vašom tele od %2$@. Neodstraňujte Pod, kým si neprečítate celú túto obrazovku. Komunikácia bola prerušená v kritickom čase. Informácie o aktívnom inzulíne alebo dočasnej bazálnej rýchlosti Podu sú neisté. Môžete skúsiť vypnúť a znova zapnúť Bluetooth v telefóne alebo ukončiť a reštartovať aplikáciu. (Počkajte až 30 sekúnd na obnovenie spojenia.) Ak sa rozhodnete Pod odstrániť, pretože komunikáciu sa nepodarilo obnoviť, klepnite na tlačidlo „Zahodiť Pod“, postupujte podľa krokov a spusťte nový Pod. Sledujte svoju glykémiu pozorne počas nasledujúcich 6 hodín, pretože vo vašom tele môže, ale nemusí byť aktívny inzulín, ktorý %3$@ nedokáže zobraziť.
sv: %1$@ har inte kunnat kommunicera med podden på din kropp sedan %2$@. Inaktivera inte din podd utan att först läsa hela meddelandet. Kommunikationen avbröts vid en kritisk tidpunkt. Information om aktiv insulin / pod temp basal är osäker. Du kan växla RileyLink-anslutning (nedan), växla telefonen Bluetooth från och på; stänga av och på; eller prova en annan RileyLink. Vänta upp till 30 sekunder. Om du väljer att avbryta eftersom kommunikation inte kan återställas, tryck då på knappen Kasta podd, följ stegen och starta sedan en ny podd. Övervaka ditt glukos noggrant de närmaste 6 timmarna eftersom det kan finnas aktivt insulin i din kropp som %3$@ inte kan visa.
uk: %1$@ не може зв’язатися з Podом на вашому тілі з %2$@. Не викидайте Pod, не прокрутивши весь екран, щоб прочитати його. Зв’язок було перервано в критичний момент. Інформація про активний інсулін / тимчасову базальну швидкість Pod є неточною. Ви можете вимкнути та ввімкнути Bluetooth на телефоні або вийти з програми та перезапустити її. (Зачекайте до 30 секунд для відновлення.) Якщо ви вирішите здатися, оскільки зв’язок неможливо відновити, натисніть кнопку «Викинути Pod», виконайте кроки та запустіть новий Pod. Уважно контролюйте рівень глюкози протягом наступних 6 годин, оскільки у вашому організмі може бути або не бути інсуліну, який %3$@ не може відобразити.
vi: %1$@ không thể liên lạc với pod trên cơ thể bạn kể từ %2$@. Đừng vứt Pod mà chưa kéo xuống đọc hết màn hình này. Liên lạc đã bị gián đoạn vào thời điểm quan trọng. Thông tin về insulin đang hoạt động / tỷ lệ basal tạm thời của pod hiện không chắc chắn. Bạn có thể: Bật/tắt Bluetooth của điện thoại, Hoặc thoát và khởi động lại ứng dụng. (Đợi tối đa 30 giây để khôi phục kết nối.) Nếu bạn quyết định từ bỏ vì không thể khôi phục liên lạc, hãy nhấn nút Vứt Pod (Discard Pod), làm theo các bước và bắt đầu một pod mới. Theo dõi sát đường huyết trong 6 giờ tới, vì có thể hoặc không có insulin đang hoạt động trong cơ thể mà %3$@ không thể hiển thị.

source: ⚠️ Insulin delivery stopped. Change Pod now.
fr: ⚠️ L'administration d'insuline est interrompue. Changez de Pod maintenant.
it: ⚠️ Erogazione d'insulina interrotta. Cambia Pod ora.
nb: ⚠️ Insulintilførsel stoppet. Bytt pod nå.
nb_no: ⚠️ Insulintilførsel stoppet. Bytt pod nå.
nl: ⚠️ Insulinetoediening gestopt. Vervang Pod nu.
ro: ⚠️ Administrarea de insulină s-a oprit. Schimbați pompa acum.
sk: ⚠️ Podávanie inzulínu bolo zastavené. Teraz vymeňte Pod.
sv: ⚠️ Insulintillförsel stoppad. Byt podd nu.
uk: ⚠️ Подача інсуліну зупинена. Негайно замініть Pod.
vi: ⚠️ Việc tiêm insulin đã dừng. Hãy thay Pod ngay.

source: All Pod alerts use no beeps and confirmation reminder beeps are suppressed. The Pod will only beep for fatal Pod faults and when playing test beeps. ⚠️Warning - If your phone is out of range of the pod while this feature is enabled, you will not receive any in-app notifications; and the pod will not beep to alert you.
fr: Toutes les alertes du Pod n'utilisent aucun bip et les bips de rappel de confirmation sont désactivés. Le Pod émettra un bip uniquement en cas de défaut fatal du Pod et lors des bips de test. ⚠️Avertissement - Si votre téléphone est hors de portée du Pod pendant que cette fonctionnalité est activée, vous ne recevrez aucune notification dans l'application ; et le Pod ne bipera pas pour vous alerter.
it: Tutti gli avvisi del Pod non emettono alcun segnale acustico e i segnali acustici di promemoria di conferma vengono soppressi. Il Pod emetterà un segnale acustico solo in caso di guasti irreversibili del Pod e durante la riproduzione di segnali acustici di prova. ⚠️Avviso: se il telefono è fuori dalla portata del Pod mentre questa funzione è attivata, non riceverai alcuna notifica in-app e il Pod non emetterà alcun segnale acustico di avviso.
nb: Alle pod-varsler bruker ingen pipelyder, og bekreftelsespipelyder undertrykkes. Pod piper bare ved fatale pod-feil og når testpipelyder spilles av. ⚠️Advarsel – Hvis telefonen din er utenfor rekkevidde for pod mens denne funksjonen er aktivert, vil du ikke motta noen varsler i appen, og pod vil ikke pipe for å varsle deg.
nb_no: Alle pod-varsler bruker ingen pipelyder, og bekreftelsespipelyder undertrykkes. Pod piper bare ved fatale pod-feil og når testpipelyder spilles av. ⚠️Advarsel – Hvis telefonen din er utenfor rekkevidde for pod mens denne funksjonen er aktivert, vil du ikke motta noen varsler i appen, og pod vil ikke pipe for å varsle deg.
nl: Alle Pod alarmen gebruiken geen biepen en bevestigingspunten worden onderdrukt. De Pod zal alleen piepen bij fatale Pod gebreken en bij het spelen van testpiepen. ⚠️Waarschuwing - Als je telefoon buiten bereik is als deze functie is ingeschakeld, krijg je geen in-app meldingen; en de pod zal niet piepen om je te waarschuwen
ro: Toate alertele pompei sunt fără semnale sonore, iar notificările de confirmare sunt suprimate. Pompa va emite semnale sonore doar în cazul erorilor grave de pompă și atunci când se redau semnale sonore de test. ⚠️Atenție - Dacă telefonul dvs. este în afara razei de acțiune a pompei în timp ce această funcție este activată, nu veți primi nicio notificare în aplicație; iar pompa nu va emite semnale sonore pentru a vă alerta.
sk: Všetky upozornenia Podu nebudú používať žiadne pípnutia a pípnutia pripomienok potvrdenia sú potlačené. Pod bude pípať iba pri závažných chybách podu a pri prehrávaní testovacích pípnutí. ⚠️ Upozornenie – keď je táto funkcia zapnutá a ak je váš telefón mimo dosahu Podu, nebudete dostávať žiadne upozornenia v aplikácii a Pod nebude pípať, aby vás upozornil.
sv: Alla Pod varningar använder inga pip och bekräftelse påminnelsen pip undertrycks. Pod kommer endast att pipa för dödliga Pod fel och när du spelar testpip. ⚠️Varning - Om din telefon är utom räckhåll för poden medan denna funktion är aktiverad, kommer du inte att få några meddelanden i appen; och poden kommer inte att pipa för att varna dig.
uk: Усі сповіщення Pod не використовують звукові сигнали, а звукові сигнали нагадування про підтвердження приглушені. Pod подаватиме звукові сигнали лише у разі фатальних несправностей Pod та під час відтворення тестових звукових сигналів. ⚠️Попередження. Якщо ваш телефон знаходиться поза зоною дії Pod, коли ця функція ввімкнена, ви не отримуватимете жодних сповіщень у додатку; і Pod не подаватиме звукових сигналів, щоб попередити вас.
vi: Tất cả cảnh báo của Pod không phát tiếng bíp, và tiếng bíp nhắc xác nhận cũng bị tắt. Pod chỉ phát tiếng bíp khi xảy ra lỗi nghiêm trọng hoặc khi thực hiện bài kiểm tra tiếng bíp. ⚠️ Cảnh báo – Nếu điện thoại của bạn ngoài phạm vi kết nối với Pod khi tính năng này được bật, bạn sẽ không nhận được bất kỳ thông báo nào trong ứng dụng, và Pod cũng sẽ không bíp để cảnh báo bạn.

source: Confidence reminders will sound for commands you initiate, like bolus, cancel bolus, suspend, resume, save notification reminders, etc. When %1$@ automatically adjusts delivery, no confidence reminders are used.
fr: Les bips de confirmation retentiront pour les commandes que vous initiez, comme un bolus, l'annulation d'un bolus, la suspension, la reprise, la sauvegarde des rappels de notification, etc. Lorsque %1$@ ajuste automatiquement l'administration, aucun bip de confirmation n'est utilisé.
it: I promemoria di sicurezza suoneranno per i comandi che avvii, come bolo, annullamento bolo, sospensione, ripresa, salvataggio promemoria notifiche, ecc. Quando %1$@ regola automaticamente l'erogazione, non vengono utilizzati promemoria di sicurezza.
nb: Tillitspåminnelser høres for kommandoer du starter, for eksempel bolus, avbryt bolus, suspendere, gjenoppta, lagre varslingspåminnelser osv. Når %1$@ automatisk justerer leveringen, brukes ingen tillitspåminnelser.
nb_no: Tillitspåminnelser høres for kommandoer du starter, for eksempel bolus, avbryt bolus, suspendere, gjenoppta, lagre varslingspåminnelser osv. Når %1$@ automatisk justerer leveringen, brukes ingen tillitspåminnelser.
nl: Piepjes uit de Pod zullen klinken voor commando's die je hebt geïnitieerd, zoals bolus, annulering, geschorst, hervatten, opslaan van meldingen etc. Als %1$@ automatisch de levering wijzigt, worden er geen piepjes gebruikt.
ro: Notificările de confirmare vor suna pentru comenzile pe care le inițiați, cum ar fi bolus, anulare bolus, suspendare, reluare, salvare mementouri de notificare etc. Când %1$@ ajustează automat livrarea, nu se folosesc notificări de confirmare.
sk: Pripomienky potvrdenia sa ozvú pri príkazoch, ktoré spustíte vy, ako napr. bolus, zrušenie bolusu, pozastavenie, obnovenie, uloženie pripomienok upozornení atď. Keď %1$@ automaticky upraví podávanie, pripomienky potvrdenia sa nepoužijú.
sv: Bekräftelseljud kommer att pipa för för alla pumpkommandon du ger, som bolus, avbryt bolus, pausa pump, återuppta insulintillförsel, spara påminnelser etc. När %1$@ automatiskt justerar insulintillförsel kommer inga pip att ljuda.
uk: Нагадування про впевненість лунатимуть для команд, які ви ініціюєте, таких як болюс, скасування болюса, призупинення, відновлення, збереження сповіщень тощо. Коли %1$@ автоматично налаштовує введення, використовуються нагадування про відсутність впевненості.
vi: Thông báo xác nhận sẽ phát tiếng bíp khi bạn thực hiện các lệnh, chẳng hạn như tiêm bolus, hủy bolus, tạm dừng, tiếp tục, lưu thông báo nhắc, v.v. Khi %1$@ tự động điều chỉnh việc tiêm, các thông báo xác nhận sẽ không được sử dụng.

source: Confidence reminders will sound when %1$@ automatically adjusts delivery as well as for commands you initiate.
fr: Des rappels de confirmation retentiront lorsque %1$@ ajustera automatiquement l'administration ainsi que pour les commandes que vous lancez.
it: I promemoria di sicurezza suoneranno quando %1$@ regola automaticamente l'erogazione e per i comandi che avvii.
nb: Tillitspåminnelser vil høres når %1$@ automatisk justerer leveringen så vel som for kommandoer du starter.
nb_no: Tillitspåminnelser vil høres når %1$@ automatisk justerer leveringen så vel som for kommandoer du starter.
nl: Piepjes zullen klinken als %1$@ de levering automatisch aanpast evenals voor commando's die je initieert.
ro: Notificările de confirmare vor suna atunci când %1$@ ajustează automat livrarea, precum și pentru comenzile pe care le inițiați.
sk: Pripomienky potvrdenia sa ozvú, keď %1$@ automaticky upraví podávanie, ako aj pri príkazoch, ktoré spustíte vy.
sv: Bekräftelsepip kommer att ljuda även vid %1$@s automatiska pumpkommandon såväl som vid manuella.
uk: Нагадування про впевненість лунатимуть, коли %1$@ автоматично налаштовуватиме доставлення.
vi: Thông báo xác nhận sẽ phát tiếng bíp khi %1$@ tự động điều chỉnh việc tiêm cũng như khi bạn thực hiện các lệnh.

source: Failed to play test beeps.
fr: Échec de la lecture des bips de test.
it: Impossibile riprodurre i segnali acustici di prova.
nb: Kunne ikke spille testpip.
nb_no: Kunne ikke spille testpip.
nl: Testpiepjes afspelen mislukt
ro: Nu s-au putut reda semnalele sonore de test.
sk: Nepodarilo sa prehrať testovacie pípnutia.
sv: Det gick inte att spela upp testpip.
uk: Не вдалося відтворити тестові звукові сигнали.
vi: Không thể phát tiếng bíp kiểm tra.

source: Failed to read pod status.
fr: Échec de la lecture de l'état du pod.
it: Impossibile leggere lo stato del Pod.
nb: Kunne ikke lese pod-status.
nb_no: Kunne ikke lese pod-status.
nl: Lezen pod status is mislukt.
ro: Nu s-a putut citi starea pompei.
sk: Nepodarilo sa prečítať stav Podu.
sv: Det gick inte att läsa podd-status.
uk: Не вдалося прочитати стан Podу.
vi: Không thể đọc trạng thái Pod.

source: Not used
fr: Non utilisé
it: Non utilizzato
nb: Ikke brukt
nb_no: Ikke brukt
nl: Niet in gebruik
sk: Nepoužíva sa
sv: Inte använd
uk: Не використовується
vi: Không sử dụng

source: Play test beeps command sent successfully. If you did not hear any beeps from your Pod, the piezo speaker in your Pod may be broken or disabled.
fr: La commande de test de lecture des bips a été envoyée avec succès. Si vous n'avez entendu aucun bip provenant de votre Pod, le haut-parleur de votre Pod est peut-être cassé ou désactivé.
it: Comando di test dei segnali acustici inviato con successo. Se non hai sentito alcun segnale acustico dal tuo Pod, lo speaker piezoelettrico del tuo Pod potrebbe essere guasto o disattivato.
nb: Kommandoen Spill av testpip sendt vellykket. Hvis du ikke hørte noen pip fra pod, kan piezohøyttaleren i pod være ødelagt eller deaktivert.
nb_no: Kommandoen Spill av testpip sendt vellykket. Hvis du ikke hørte noen pip fra pod, kan piezohøyttaleren i pod være ødelagt eller deaktivert.
nl: Test beeps commando met succes verzonden. Als je geen beeps vanuit je pod hebt gehoord is het goed mogelijk dat de speaker van de pod kapot is.
ro: Comanda de semnale sonore de testare a fost trimisă cu succes. Dacă nu ați auzit niciun semnal sonor de la pompă, difuzorul piezo din pompă poate fi stricat sau dezactivat.
sk: Príkaz na prehratie testovacích pípnutí bol úspešne odoslaný. Ak ste nepočuli žiadne pípnutie z Podu, piezo reproduktor vo vašom pode môže byť pokazený alebo vypnutý.
sv: Kommandot för uppspelning av testljud skickades. Om du inte hörde några pip från din podd, är det troligt att piezohögtalaren i din podd är sönder eller inaktiverad.
uk: Команду відтворення тестових звукових сигналів успішно надіслано. Якщо ви не чули жодних звукових сигналів від вашого Pod, можливо, п'єзодинамік у вашому Pod зламаний або несправний.
vi: Lệnh phát tiếng bíp kiểm tra đã được gửi thành công. Nếu bạn không nghe thấy bất kỳ tiếng bíp nào từ Pod, loa piezo trong Pod có thể bị hỏng hoặc bị tắt.

source: Playing Test Beeps...
fr: Lecture des bips de test...
it: Riproduzione dei segnali acustici di test in corso...
nb: Spiller av testpip...
nb_no: Spiller av testpip...
nl: Speel testpiepjes af...
ro: Redarea semnalelor sonore de testare...
sk: Prehrávanie testovacích pípnutí...
sv: Spelar upp testljud...
uk: Відтворення тестових звукових сигналів...
vi: Đang kiểm tra tiếng Bíp...

source: Pod Active: %1$@
fr: Pod Actif : %1$@
it: Pod attivo: %1$@
nb: Pod aktiv: %1$@
nb_no: Pod aktiv: %1$@
nl: Pod actief: %1$@
ro: Pompă activă: %1$@
sk: Pod aktívny: %1$@
sv: Podd aktiv: %1$@
uk: Активний Pod: %1$@
vi: Pod hoạt động: %1$@

source: Pod Fault %1$03d
fr: Erreur du pod %1$03d
it: Guasto Pod %1$03d
nb: Pod-feil %1$03d
nb_no: Pod-feil %1$03d
nl: Pod fout: %1$03d
ro: Eroare pompă %1$03d
sk: Chyba Podu: %1$03d
sv: Poddfel: %1$03d
uk: Помилка Pod %1$03d
vi: Pod lỗi: %1$03d

source: Pod setup is not complete
fr: La configuration du pod n'est pas terminée
it: La configurazione del Pod non è completa
nb: Pod-oppsettet er ikke fullført
nb_no: Pod-oppsettet er ikke fullført
nl: Pod setup is niet voltooid
ro: Configurarea pompei nu este finalizată
sk: Nastavenie Podu nie je dokončené
sv: Poddkonfiguration är inte klar
uk: Налаштування Pod не завершено
vi: Pod chưa được cài đặt xong

source: Possible Bluetooth issue
fr: Problème Bluetooth possible
it: Possibile problema Bluetooth
nb: Mulig Bluetooth-problem
nb_no: Mulig Bluetooth-problem
nl: Mogelijk Bluetooth probleem
ro: Posibilă problemă Bluetooth
sk: Možný problém s Bluetooth
sv: Möjligt problem med Bluetooth
uk: Можлива проблема з Bluetooth
vi: Có thể có sự cố Bluetooth

source: Slide Button to insert Cannula
fr: Faites glisser pour insérer la canule
it: Fai scorrere il pulsante per inserire la cannula
nb: Skyveknapp for å sette inn kanylen
nb_no: Skyveknapp for å sette inn kanylen
nl: Schuif om de canule in te brengen
ro: Glisați butonul pentru a introduce canula
sk: Posuňte tlačidlo na zavedenie kanyly
sv: Svep för att föra in kanyl
uk: Готовий до введення канюлі
vi: Trượt nút để chèn kim tiêm
